package petsHotel.model;
//Задача 1. Создайте дочерние от класса Pet классы Cat и Dog c
// дополнительными полями: порода, рост, вес.
// Создайте метод voice, который выдает "Мяу!" для класса Cat и и "Гав-гав!" для класса Dog.
// Создайте HouseAppl, в котором есть метод main. Поселите в доме 2 собаки и 3 кошки.
// Смоделируйте жизнь в этом доме в течение дня.
/*
public class PetAppl {
    public static void main(String[] args) {
        Dog dog = new Dog(1 , "dog",2,"Partizan","pooch",0.9,30);
        dog.display();
        dog.play();
        dog.voice();
        System.out.println("*******************");

        Dog dog1 = new Dog(2,"dog",10,"Bim","Labrodor",0.7,35);
        dog.display();
        dog.sleep();
        System.out.println("*******************");

        Cat cat = new Cat(3,"cat",1,"Vasya","Siam", 0.4,6);
        cat.display();
        cat.eat();
        System.out.println("*******************");

        Cat cat1 = new Cat(4,"cat",6,"Tsar","Maine Coon",0.35,5);
        cat1.display();
        cat1.play();
        cat1.voice();
        System.out.println("Cat Tsar playing with dog Partizan.");
        System.out.println("*******************");

        Cat cat2 = new Cat(5,"cat",3,"Puhla","British cat",0.3,3);
        cat.display();
        cat.sleep();


    }
}
*/
